MAVProxyUser/MITCheetahSTM31MP1-Claude/stm32mp1/gazebo/mit_sim_main.cpp
  /*
   * CLOSE THE FINAL LEG back to home ($WP_CLOSE_LEG, DEFAULT ON).
   *
   * Operator-reported: "some missions never close their path to the home
   * point, but some do... leaves a final leg unclosed." Measured, and they
   * are right - the periodic curves (lissajous/spiro/atom/oval) land within
   * 0.00-1.20 m of home by construction while circle/sector/expsquare/
   * parallel stop 6.9/15.0/18.0/46.1 m out, purely as an artefact of where
   * each generator's own math happens to end. makeStar already closes
   * itself explicitly ("closing belongs to the mission itself"); this
   * generalises that precedent to every course instead of leaving it
   * per-generator.
   *
   * Runs BEFORE appendDash on purpose: the dash is a finish tacked onto a
   * COMPLETED loop, and appendDash's own "is this course already closed"
   * test keys off the last waypoint's distance from wp00 - so closing first
   * means the dash correctly appends one sprint point to a now-closed
   * course rather than a redundant return leg. See closeFinalLeg() for why
   * a 1-waypoint dash and an already-closed curve are both no-ops.
   */
  if (!getenv("WP_CLOSE_LEG") || atoi(getenv("WP_CLOSE_LEG")) != 0)
    nav.closeFinalLeg();

  // $WP_DASH=<metres>: append a straight finishing sprint after the loop
  // above closes, continuing along whatever heading the final leg left the
  // dog on. This is the 100 m dash as a FINISH, not a standalone course - the
  // dog proves it can corner the whole loop, then gets to show what its gait
  // does in a straight line once there is nothing left to turn for.
  //
  // Per direct instruction, the handoff between loop and dash is not just a
  // waypoint change: the dog stops, lies down, and stands back up before the
  // sprint - the same lie-down/stand-up the QA ladder already rehearses at
  // the true end of every mission (see the END-OF-MISSION SEQUENCE below),
  // just run once more in the middle instead of only at the finish.
  // The dash target is always the LAST waypoint appendDash produced -
  // one point on an already-closed course (star/oval/atom all close their
  // own stroke now), two (return-to-wp00, then the sprint) on an open one.
  // The interlude fires once nav advances ONTO the dash point, i.e. the
  // dog has genuinely closed the shape before it stops and lies down.
  const int loop_wp_count = nav.count();
  bool dash_pending = false;
  if (getenv("WP_DASH")) {
    nav.appendDash(atof(getenv("WP_DASH")), vx);
    dash_pending = nav.count() > loop_wp_count;
  }
  const int dash_wp_index = nav.count() - 1;

  if (getenv("WP_ACCEPT"))   nav.accept_radius = atof(getenv("WP_ACCEPT"));
  // See WaypointNav.hpp's field comment: WP_ACCEPT also sizes the
  // BodyPathPlanner cornering corridor, so a course tuned for tight
  // corners "arrives" at EVERY waypoint - including the mission-end /
  // loop-closure one - a full WP_ACCEPT short of its literal coordinate.
  // Invisible mid-course (the next leg starts regardless); a visible gap
  // on a closed course's own flown-trail plot, since there is no next leg
  // to cover it. Opt-in, off by default (-1) so nothing changes unless a
  // recipe asks for it.
  if (getenv("WP_FINAL_ACCEPT")) nav.final_accept_radius = atof(getenv("WP_FINAL_ACCEPT"));
  if (getenv("WP_LOOP"))     nav.loop = true;
  // The MPC trot turns far harder than the crawl, which is what max_yawrate was
  // sized for (0.7 rad/s was "what the crawl can actually deliver").
  nav.max_yawrate = getenv("WP_MAX_YAWRATE") ? atof(getenv("WP_MAX_YAWRATE")) : 1.2f;
  nav.kp_heading  = getenv("WP_KP_HEADING")  ? atof(getenv("WP_KP_HEADING"))  : 2.2f;
  // Dynamic gaits arc through corners; they fall over trying to pivot in them.
  nav.turn_speed_floor = getenv("WP_TURN_FLOOR") ? atof(getenv("WP_TURN_FLOOR")) : 0.65f;

  // YAW SIGN: +1, and this was MEASURED, not reasoned. The old default of -1
  // captured 1 of 5 waypoints and never finished a mission; +1 captures 5 of 5
  // and completes the 100 m star in 46.5 s. Same binary, same run, one flag.
  //
  // Why -1 looked right and was wrong: the comment here used to say "MIT's yaw
  // rate is CCW-positive, nav's is compass-sense, so negate". Both halves are
  // true, but the chain has a THIRD negation in it -
  // `DesiredStateCommand.cpp` does `joystickRight[0] *= -1` (upstream MIT, and
  // correct: right stick right should turn the robot right). Two negations
  // cancel, so negating here inverted the steering and the robot turned away
  // from every waypoint. A sign argued from two of three terms is a guess.
  const float yaw_sign = getenv("WP_YAW_SIGN") ? atof(getenv("WP_YAW_SIGN")) : 1.f;

  /*
   * $WP_PLANNER=1 swaps the pure-pursuit follower for the Apollo-derived
   * planner: the waypoint polyline is rounded into fillet arcs, curvature gives
   * v_max(s) = sqrt(a_lat/kappa), and forward/backward accel passes make the
   * braking start BEFORE the corner instead of during it. The heuristic it
   * replaces (WP_TURN_FLOOR) completes 2 runs in 3 and fails badly if tuned any
   * deeper, which is what a hand-picked constant tends to do.
   */
  const bool use_planner = getenv("WP_PLANNER") && atoi(getenv("WP_PLANNER")) != 0;
  const bool  use_analyzer = getenv("WP_ANALYZER") && atoi(getenv("WP_ANALYZER")) != 0;
  const float analyzer_lead = getenv("WP_ANALYZER_LEAD") ? atof(getenv("WP_ANALYZER_LEAD")) : 4.0f;

  planning::BodyPathPlanner planner;
  planning::MissionAnalyzer analyzer;
  // Stop coordinates, kept for the nav loop's "no gait changes inside a
  // stop's braking zone" hold (see the gait-change gate below). [0] = the
  // dash-interlude closure (valid while dash_pending), [1] = the final
  // waypoint (always a stop - the end-of-mission lie-down).
  float hold_stop_n[2] = {0, 0}, hold_stop_e[2] = {0, 0};
  if (use_planner) {
    // The path must START WHERE THE ROBOT IS. Building it from the waypoints
    // alone begins it at wp00, 10.5 m away, so the follower spent the whole
    // mission chasing a path it was never on: 75.1 m of path (4 legs) instead
    // of 93 m (5), and 0 of 5 waypoints. The robot sits at the local-frame
    // origin when the GPS datum is taken, so (0,0) is the true first point.
    std::vector<double> wx{0.0}, wy{0.0};
    for (int i = 0; i < nav.count(); ++i) {
      wx.push_back(nav.waypoint(i).north);
      wy.push_back(nav.waypoint(i).east);
    }
    planning::BodyLimits lim;
    lim.v_cruise  = vx;
    lim.a_lat_max = getenv("WP_ALAT") ? atof(getenv("WP_ALAT")) : 2.5;
    // TERRAIN AWARENESS (OPEN-7): the conductor knows which ground it built
    // the world on and passes that ground's friction (and, for the
    // procedural heightmap kinds, a measured speed ceiling) here. Unset =
    // -1 = the planner behaves exactly as before, so every validated flat
    // result is untouched. See BodyLimits::mu_terrain for why mu*g is the
    // right cap and how it matches the measured terrain sweep.
    lim.mu_terrain = getenv("WP_TERRAIN_MU")
                       ? atof(getenv("WP_TERRAIN_MU")) : -1.0;
    lim.v_terrain_max = getenv("WP_TERRAIN_VMAX")
                       ? atof(getenv("WP_TERRAIN_VMAX")) : -1.0;

