MAVProxyUser/MITCheetahSTM31MP1-Claude/stm32mp1/gazebo/mit_sim_main.cpp
    lim.yaw_rate_max = nav.max_yawrate;
    lim.track_lag_s  = getenv("WP_LAG") ? atof(getenv("WP_LAG")) : 1.2;
    planner.setLimits(lim);
    if (getenv("WP_ALON")) planner.setAlonExplicit(atof(getenv("WP_ALON")));
    if (getenv("WP_AACC")) { auto L=planner.limits(); L.a_accel_max=atof(getenv("WP_AACC")); planner.setLimits(L); }
    if (getenv("WP_TURN_SOFT")) { auto L=planner.limits(); L.turn_soft=atof(getenv("WP_TURN_SOFT")); planner.setLimits(L); }
    if (getenv("WP_TURN_HARD")) { auto L=planner.limits(); L.turn_hard=atof(getenv("WP_TURN_HARD")); planner.setLimits(L); }
    if (getenv("WP_CSCALE"))    { auto L=planner.limits(); L.corner_scale_min=atof(getenv("WP_CSCALE")); planner.setLimits(L); }
    // Same turn_soft/turn_hard grading, applied to the fillet's geometric
    // corridor instead of the lateral-accel budget - shrinks how far an
    // acute corner's rounded arc misses the true vertex by. See the field
    // comment on BodyLimits::corridor_scale_min.
    if (getenv("WP_CORRIDOR_MIN")) { auto L=planner.limits(); L.corridor_scale_min=atof(getenv("WP_CORRIDOR_MIN")); planner.setLimits(L); }
    if (getenv("WP_HAIRPIN")) { auto L = planner.limits(); L.hairpin_rad = atof(getenv("WP_HAIRPIN")); planner.setLimits(L); }
    if (getenv("WP_VPIVOT"))  { auto L = planner.limits(); L.v_pivot     = atof(getenv("WP_VPIVOT"));  planner.setLimits(L); }
    const double corridor = getenv("WP_ACCEPT") ? atof(getenv("WP_ACCEPT")) : 1.0;
    /*
     * STOPS ARE PART OF THE PLAN (see BodyPathPlanner::addStopXY). The path
     * end always brakes to v_min (every mission finishes with a lie-down);
     * with a dash appended, the loop-closure waypoint - where the dog stops,
     * lies down and stands back up before the sprint - is a mid-path stop,
     * so the profile brakes into it and re-accelerates out of it with the
     * same two-pass math the corners use. Before this, the dog arrived at
     * both at full cruise and the stop sequence was really a crash-stop.
     */
    if (getenv("WP_END_BRAKE") && atoi(getenv("WP_END_BRAKE")) == 0)
      planner.setEndStop(false);
    if (dash_pending) {
      const auto& stopw = nav.waypoint(dash_wp_index - 1);
      planner.addStopXY(stopw.north, stopw.east);
      hold_stop_n[0] = stopw.north; hold_stop_e[0] = stopw.east;
      shmtrace::logf(0.0, "[plan] mid-path stop registered at the loop closure "
             "(wp%02d N=%.2f E=%.2f) for the dash interlude",
             dash_wp_index - 1, stopw.north, stopw.east);
    }
    /*
     * A NEAR-180 REVERSAL IS A STOP, and the profile cannot see it.
     * computeGeometry() estimates curvature from three consecutive path
     * points; on a course that doubles back along its own line (the
     * out-and-back dash) those three points are COLLINEAR, so kappa comes
     * out ~0 and the turnaround reads as a straight. Measured: the dash
     * held 3.00 m/s right into its own 180 and went over. Curvature cannot
     * express "reverse direction here" - a stop can, and the braking
     * machinery already exists. Only fires on courses that actually
     * reverse; star/oval/atom never do, so they are untouched.
     */
    for (size_t k = 1; k + 1 < wx.size(); ++k) {
      const double ax = wx[k] - wx[k-1], ay = wy[k] - wy[k-1];
      const double bx = wx[k+1] - wx[k], by = wy[k+1] - wy[k];
      const double la = std::hypot(ax, ay), lb = std::hypot(bx, by);
      if (la < 1e-6 || lb < 1e-6) continue;
      const double cosd = (ax*bx + ay*by) / (la * lb);
      if (cosd < -0.87) {          // direction change > 150 deg
        planner.addStopXY(wx[k], wy[k]);
        shmtrace::logf(0.0, "[plan] reversal at (%.1f, %.1f) registered as a stop "
               "(%.0f deg turn - curvature cannot see it)",
               wx[k], wy[k], std::acos(std::max(-1.0, cosd)) * 57.2958);
      }
    }
    hold_stop_n[1] = nav.waypoint(nav.count() - 1).north;
    hold_stop_e[1] = nav.waypoint(nav.count() - 1).east;
    planner.plan(wx, wy, 0.10, false, corridor);
    if (getenv("WP_PLAN_DBG")) {
      const auto& pp = planner.path();
      shmtrace::logf(0.0, "[plandbg] path.size()=%zu", pp.size());
      for (size_t k = pp.size() > 20 ? pp.size() - 20 : 0; k < pp.size(); ++k)
        shmtrace::logf(0.0, "[plandbg] i=%zu s=%.3f x=%.3f y=%.3f v=%.3f",
               k, pp[k].s, pp[k].x, pp[k].y, pp[k].v);
    }
    /*
     * ANALYSE THE MISSION ONCE, HERE, BEFORE THE DOG MOVES.
     *
     * Everything about a route that can be known is known now: the geometry is
     * fixed, so the curvature, the speed each point allows, which turns last
     * long enough to need a different gait, and where the time is actually
     * lost are all computable before the first step. Re-deriving any of it at
     * 50 Hz from a filtered estimate is strictly worse, and has already
     * produced a decider that could not tell a star vertex from an atom lobe.
     */
    planning::MissionPolicy pol;
    pol.kappa_min     = getenv("WP_REGIME_K")   ? atof(getenv("WP_REGIME_K"))   : pol.kappa_min;
    pol.sustained_m   = getenv("WP_REGIME_LEN") ? atof(getenv("WP_REGIME_LEN")) : pol.sustained_m;
    pol.min_switch_m  = getenv("WP_MIN_SWITCH") ? atof(getenv("WP_MIN_SWITCH")) : pol.min_switch_m;
    pol.gait_fast     = getenv("WP_GAIT_FAST")   ? atoi(getenv("WP_GAIT_FAST"))   : pol.gait_fast;
    pol.gait_sustained= getenv("WP_GAIT_CORNER") ? atoi(getenv("WP_GAIT_CORNER")) : pol.gait_sustained;
    pol.hbias_max     = getenv("WP_HBIAS")      ? atof(getenv("WP_HBIAS"))      : pol.hbias_max;
    pol.v_sustained_max = getenv("WP_VSUS") ? atof(getenv("WP_VSUS")) : pol.v_sustained_max;
    // Settling lead-in multiplier for the sustained cap - see
    // MissionAnalyzer::applyTo(). 0 = arrive-hot (old behaviour), for A/B.
    pol.entry_settle_x  = getenv("WP_ENTRY_SETTLE") ? atof(getenv("WP_ENTRY_SETTLE")) : pol.entry_settle_x;
    // ALWAYS analyse (the brief is free and worth having in every log), but
    // only ACT on it when asked. applyTo() imposes the sustained-curve speed
    // ceiling, which is a behaviour change - running it unconditionally made
    // the "bare" arm of an A/B not bare, and would have silently treated the
    // control group on every atom phase where sustained segments dominate.
    analyzer.analyze(planner, pol);
    if (use_analyzer) {
      // Two-pass: classify, impose the ceiling, re-plan, re-classify so the
      // printed brief is the plan the robot actually flies.
      analyzer.applyTo(planner, pol);
      analyzer.analyze(planner, pol);
    }
    analyzer.print();

    double kk, vv; planner.tightestCorner(&kk, &vv);
    shmtrace::logf(0.0, "[plan] %zu pts, %.1f m, tightest R=%.2f m -> %.2f m/s "
           "(cruise %.2f, a_lat %.2f, corridor %.2f)",
           planner.path().size(), planner.path().empty() ? 0.0 : planner.path().back().s,
           kk > 1e-6 ? 1.0/kk : 0.0, vv,
           // the PLANNER's own post-terrain-cap limits, not the caller's
           // pre-cap copy - a summary that contradicts the [plan] terrain
           // line two rows above it is worse than no summary.
           planner.limits().v_cruise, planner.limits().a_lat_max, corridor);
  }

