MAVProxyUser/MITCheetahSTM31MP1-Claude/stm32mp1/gazebo/mit_sim_main.cpp
  /*
   * ONE decel-ramp mechanism, used by both the dash-interlude's mid-path
   * stop and the end-of-mission stop. These used to be two independently
   * patched copies of the same fix (seed from the live stick value vs.
   * seed from nv, each separately min()'d against planner.plannedSpeed()
   * after the same bug - follow() bailing out near a path's end leaves
   * whichever seed stale/unbraked - was found twice). Callers pass
   * whatever they'd naturally have used as the ramp's starting speed
   * (the live stick value, or nv); this decides whether the planner's
   * own braked value is actually the safer bound and applies it, so
   * there is exactly one place that decision is made.
   */
  auto decelerateAndConfirmStopped = [&](float candidate_speed) {
    const float seed = use_planner
        ? std::min(candidate_speed, (float)planner.plannedSpeed())
        : candidate_speed;
    for (int k = 15; k >= 0; --k) {
      // STEERED deceleration: keep the follower's steering live through the
      // first 0.5 s of the ramp so the dog straightens onto the exit heading
      // as it slows, rather than zeroing yaw while it still carries a turn's
      // residual yaw/roll (measured to tip the oval's stop 53-88 deg, ~50%
      // of the time, before this existed). On a straight approach the
      // follower already outputs w~0 and this is a no-op.
      float w_dec = 0.f;
      if (use_planner && k > 5) {
        SimAuxSensors aux2; gazebo_get_aux(&aux2);
        float N2, E2; nav.toLocal(aux2.gps_lat, aux2.gps_lon, &N2, &E2);
        const auto& es2 = bridge->robotRunner()->getStateEstimate();
        const float b2 = spawn_bearing_rad - (es2.rpy[2] - yaw_ref);   // same correction as "bearing" above
        double pv2 = 0, pw2 = 0;
        if (planner.follow(N2, E2, b2, &pv2, &pw2)) w_dec = (float)pw2;
      }
      bridge->driverCommand().leftStickAnalog[1]  = seed * (float)k / 15.f;
      bridge->driverCommand().rightStickAnalog[0] = w_dec;
      std::this_thread::sleep_for(std::chrono::milliseconds(50));
    }
    bridge->driverCommand().leftStickAnalog[1]  = 0.f;
    bridge->driverCommand().rightStickAnalog[0] = 0.f;
    // VERIFY the real measured speed actually dropped, rather than assuming
    // the commanded ramp above was enough - a fixed timer here is exactly
    // the class of assumption that cost a day chasing "stale" behaviour
    // elsewhere in this file. Bounded timeout as a backstop only.
    const float settle_start = elapsed();
    while (elapsed() - settle_start < 2.0f) {
      if (bridge->robotRunner()) {
        const auto& es = bridge->robotRunner()->getStateEstimate();
        const float spd = std::sqrt(es.vBody[0] * es.vBody[0] +
                                     es.vBody[1] * es.vBody[1]);
        if (spd < 0.15f) break;
      }
      std::this_thread::sleep_for(std::chrono::milliseconds(50));
    }
  };

  // ESTOP RECOVERY. See RobotController::isEstopped()'s comment for the
  // mechanism: MIT's stock FSM latches ESTOP forever on its own (a
  // deliberate real-hardware fail-safe - no self-reset without something
  // explicitly asking for one). Per direct instruction, built DELIBERATELY
  // this time, unlike the earlier host-stall mitigation that reacted to a
  // mere TIMING signal (a control-period spike that might not even cause a
  // real problem) and did active harm reacting to ordinary jitter - see
  // CLAUDE.md's "the stall MITIGATION was worse than the stall". This is
  // categorically different: it only ever engages on a CONFIRMED, already-
  // happened safety event (the FSM already cut the motors), never on a
  // prediction, and it reuses the SAME battle-tested boot sequence mission
  // start and the dash interlude already use - no new, unvalidated control
  // behaviour, no abrupt commands.
  const bool estop_recover_on =
      !getenv("WP_ESTOP_RECOVER") || atoi(getenv("WP_ESTOP_RECOVER")) != 0;
  const int max_estop_attempts =
      getenv("WP_ESTOP_MAX_ATTEMPTS") ? atoi(getenv("WP_ESTOP_MAX_ATTEMPTS")) : 3;
  int estop_attempts = 0;

  while (!done) {
    std::this_thread::sleep_for(std::chrono::milliseconds(20));
    if (!bridge->robotRunner()) continue;
    const auto& est = bridge->robotRunner()->getStateEstimate();

    SimAuxSensors aux;
    gazebo_get_aux(&aux);
    if (!nav.originSet()) {
      if (aux.gps_lat == 0.0) continue;
      nav.setOrigin(aux.gps_lat, aux.gps_lon);
      // Measured, not hardcoded pi/2 - see the "bearing" comment below for
      // why (works identically whether the estimator zeroes its own yaw or
      // reports true world yaw). spawn_bearing_rad is the separate
      // correction that makes this correct again now that spawn heading is
      // mission-specific rather than always north.
      yaw_ref = est.rpy[2];
      shmtrace::logf(elapsed(), "[nav] GPS origin set, heading datum %.1f deg (spawn bearing %.1f deg)",
             yaw_ref * 57.2958f, spawn_bearing_rad * 57.2958f);
    }

    if (estop_recover_on && bridge->robotRunner() &&
        bridge->robotRunner()->_robot_ctrl->isEstopped()) {
      if (estop_attempts >= max_estop_attempts) {
        // Give up rather than flail forever - leave it ESTOPped and let the
        // mission end normally (timeout / the harness's own zombie
        // detection). Retrying a genuinely broken situation N+1 times
        // buys nothing over N.
        std::this_thread::sleep_for(std::chrono::milliseconds(200));
        continue;
      }
      ++estop_attempts;
      shmtrace::logf(elapsed(), "[recover] ESTOP detected (attempt %d/%d) - waiting for a safe, "
             "settled orientation before attempting to stand back up",
             estop_attempts, max_estop_attempts);
      {
        const auto& re = est;   // the SAME estimate that triggered isEstopped() above
        const float rc4[4] = {(float)re.contactEstimate[0], (float)re.contactEstimate[1],
                               (float)re.contactEstimate[2], (float)re.contactEstimate[3]};
        shmtrace::log("recover_wait", elapsed(), re.rpy[0], re.rpy[1], re.rpy[2],
                      re.omegaBody[0], re.omegaBody[1], re.omegaBody[2],
                      re.vBody[0], re.vBody[1], re.vBody[2], re.position[2],
                      (float)estop_attempts, 2, 1, rc4);
      }

      // 1. WAIT FOR SAFE AND SETTLED, bounded. A stand-up sequence assumes
      //    starting from a roughly-upright crouch, not from actually lying
      //    on its side - attempting one on a genuinely fallen robot is not
      //    "gentler", it is undefined. 30 deg is well under the debounced
      //    fall detector's own 50 deg trip and well under checkSafeOrientation's
      //    own limit, so "settled under 30" is a real margin, not a coin
      //    flip; held for 1 s so a robot still actively oscillating does
      //    not get judged safe on one lucky sample.
      const float SETTLE_DEG = 30.f, SETTLE_HOLD_S = 1.f, SETTLE_TIMEOUT_S = 15.f;
      const float wait_start = elapsed();
      float safe_since = -1.f;
      bool settled = false;
      while (elapsed() - wait_start < SETTLE_TIMEOUT_S) {
        if (bridge->robotRunner()) {
          const auto& es = bridge->robotRunner()->getStateEstimate();
          const float r = std::fabs(es.rpy[0]) * 57.2958f;
          const float p = std::fabs(es.rpy[1]) * 57.2958f;
          if (r < SETTLE_DEG && p < SETTLE_DEG) {
            if (safe_since < 0.f) safe_since = elapsed();
            if (elapsed() - safe_since > SETTLE_HOLD_S) { settled = true; break; }
          } else {
            safe_since = -1.f;
          }
        }
        std::this_thread::sleep_for(std::chrono::milliseconds(100));
      }

      if (!settled) {
        shmtrace::logf(elapsed(), "[recover] gave up after %.0fs - orientation never settled "
               "under %.0f deg, this looks like a genuine fall rather than "
               "a transient trip. Leaving it ESTOPped.",
               SETTLE_TIMEOUT_S, SETTLE_DEG);
        if (bridge->robotRunner()) {
          const auto& rg = bridge->robotRunner()->getStateEstimate();
          const float rc4[4] = {(float)rg.contactEstimate[0], (float)rg.contactEstimate[1],
                                 (float)rg.contactEstimate[2], (float)rg.contactEstimate[3]};
          shmtrace::log("recover_giveup", elapsed(), rg.rpy[0], rg.rpy[1], rg.rpy[2],
                        rg.omegaBody[0], rg.omegaBody[1], rg.omegaBody[2],
                        rg.vBody[0], rg.vBody[1], rg.vBody[2], rg.position[2],
                        SETTLE_TIMEOUT_S, 2, 1, rc4);
        }
        continue;
      }

      // 2. CLEAR THE ESTOP, then run the SAME boot sequence mission start
      //    and the dash interlude already use (PASSIVE -> STAND_UP ->
      //    BALANCE_STAND -> LOCOMOTION) - no new control behaviour.
      //    RobotController::Estop() is MIT_Controller's own existing
      //    override (_controlFSM->initialize()), which resets operatingMode
      //    to NORMAL and currentState to PASSIVE - previously only ever
      //    called by an operator's real E-stop button, never mid-mission.
      //    Suspend both stall/fall checks around our OWN commanded sequence
      //    for the identical reason the interlude suspends them around
      //    its stop/lie-down/stand-up - a transient wobble during the
      //    stand-up interpolation itself must not re-trip immediately.
      setFallZEnable(false);
      setOrientTripEnable(false);
      bridge->robotRunner()->_robot_ctrl->Estop();
      setEdamp(0.0);
      setStandUpHeight(0.25);
      bridge->setControlMode(1);                 // K_STAND_UP
      std::this_thread::sleep_for(std::chrono::milliseconds(2500));
      bridge->setControlMode(3);                 // K_BALANCE_STAND
      std::this_thread::sleep_for(std::chrono::milliseconds(1500));
      bridge->setControlMode(4);                 // K_LOCOMOTION
      std::this_thread::sleep_for(std::chrono::milliseconds(1000));

      const auto& es3 = bridge->robotRunner()->getStateEstimate();
      const float rec_z = es3.position[2];
      const float rec_roll  = std::fabs(es3.rpy[0]) * 57.2958f;
      const float rec_pitch = std::fabs(es3.rpy[1]) * 57.2958f;
      const bool recovered = rec_z > 0.20f && rec_roll < 20.f && rec_pitch < 20.f;
      setFallZEnable(true);
      setOrientTripEnable(true);

      {
        const float rc4[4] = {(float)es3.contactEstimate[0], (float)es3.contactEstimate[1],
                               (float)es3.contactEstimate[2], (float)es3.contactEstimate[3]};
        shmtrace::log(recovered ? "recover_ok" : "recover_fail", elapsed(),
                      es3.rpy[0], es3.rpy[1], es3.rpy[2],
                      es3.omegaBody[0], es3.omegaBody[1], es3.omegaBody[2],
                      es3.vBody[0], es3.vBody[1], es3.vBody[2], rec_z,
                      (float)estop_attempts, recovered ? 0 : 2, 1, rc4);
      }
      if (recovered) {
        restart_t = elapsed();   // ramp forward speed again from this standstill, not a step
        shmtrace::logf(elapsed(), "[recover] back on its feet at t=%.1fs (z=%.3f roll=%.1f pitch=%.1f) "
               "- resuming mission at wp%02d of %d",
               elapsed(), rec_z, rec_roll, rec_pitch, nav.activeIndex(), nav.count());
      } else {
        shmtrace::logf(elapsed(), "[recover] stand-up did not verify (z=%.3f roll=%.1f pitch=%.1f) - "
               "will retry if attempts remain", rec_z, rec_roll, rec_pitch);
      }
      continue;
    }

    float N, E;
    nav.toLocal(aux.gps_lat, aux.gps_lon, &N, &E);
    // Compass bearing (0 = north, positive toward east). -(rpy[2] - yaw_ref)
    // alone gives bearing RELATIVE TO SPAWN HEADING, not relative to true
    // north - deliberately measured rather than a hardcoded pi/2, so this
    // still works identically whether the estimator zeroes its yaw
    // (VectorNav path) or reports true world yaw (cheater path), which
    // differ by exactly this constant. That was invisible for a long time
    // because every mission used to spawn facing due north, so "relative to
    // spawn" and "relative to true north" were silently the same number.
    // They no longer are: WaypointNav::shiftFirstToOrigin() means the robot
    // now spawns ON wp0 for every mission, and mission_spawn_yaw_rad()
    // (mission_geometry.py) faces it at wp1 instead of north so the first
    // real leg needs no in-place hairpin - so spawn heading is mission-
    // specific now, and nav's OWN target bearings (computed from wp0/wp1
    // north/east coordinates) are still in the TRUE-NORTH frame regardless.
    // Caught live: the star mission spawned facing 162 degrees off north,
    // "relative to spawn" read 0 at t=0 same as always, and the dog walked
    // a confident, perfectly straight line 180 degrees away from wp1 for
    // the entire run. spawn_bearing_rad (WP_SPAWN_BEARING_DEG, the exact
    // same bearing mission_spawn_yaw_rad used to aim the spawn pose) is the
    // fixed correction: it is 0 for the old universal-north convention (so
    // this reproduces the previous behaviour exactly when unset) and the
    // real opening bearing otherwise.
    const float bearing = spawn_bearing_rad - (est.rpy[2] - yaw_ref);
    const float spd = sqrtf(est.vBody[0] * est.vBody[0] + est.vBody[1] * est.vBody[1]);

    float nv = 0.f, nw = 0.f;
    // NAV owns mission state (arrival tests, waypoint advance, completion); the
    // planner only supplies the COMMANDS. Letting the planner's end-of-path
    // decide completion would end the mission wherever the smoothed path ran
    // out, which is not where the waypoints are.
    bool running = nav.update(N, E, bearing, spd, dt, &nv, &nw);
    if (use_planner) {
      double pv = 0, pw = 0;
      if (planner.follow(N, E, bearing, &pv, &pw)) { nv = (float)pv; nw = (float)pw; }
    }

