MAVProxyUser/MITCheetahSTM31MP1-Claude/stm32mp1/gazebo/mit_sim_main.cpp
      // 4. judge. Upright while standing, actually lower afterwards, and still
      //    level on the ground - a topple registers as attitude, not height.
      const bool ok_stand = (stand_z > 0.20f && stand_roll < 15.f && stand_pitch < 15.f);
      const bool ok_down  = (down_z < stand_z - 0.06f && down_roll < 20.f && down_pitch < 20.f);
      shmtrace::logf(elapsed(), "[mission] settle: z=%.3f roll=%.1f pitch=%.1f -> %s",
             stand_z, stand_roll, stand_pitch, ok_stand ? "ok" : "BAD");
      shmtrace::logf(elapsed(), "[mission] laydown: z=%.3f roll=%.1f pitch=%.1f -> %s",
             down_z, down_roll, down_pitch, ok_down ? "ok" : "BAD");
      shmtrace::logf(elapsed(), "[mission] RESULT: %s  (waypoints %d/%d, settle %s, laydown %s)",
             (ok_stand && ok_down) ? "PASS" : "FAIL",
             nav.count(), nav.count(), ok_stand ? "ok" : "bad", ok_down ? "ok" : "bad");
      std::this_thread::sleep_for(std::chrono::milliseconds(500));
      /*
       * _exit, NOT exit - THIS WAS THE "Abort trap: 6".
       *
       * exit() runs static destructors and atexit handlers, while the 500 Hz
       * control loop, the motor task and the MPC worker are all still running.
       * Those threads then touch destroyed objects and the runtime aborts:
       * "libc++abi: terminating". It only ever fired AFTER a mission completed,
       * because this is the only exit() in the program - which is exactly the
       * pattern observed (three sweeps, always on a run that had already
       * printed MISSION COMPLETE, never on a failure).
       *
       * RobotRunner's fall detector already uses _exit() for the same reason.
       * On hardware this matters far more than in sim: tearing down the process
       * while motor threads are mid-command is not something to leave to luck.
       */
      _exit(0);
    }

    /*
     * FORWARD-SPEED RAMP, STEERING AT FULL AUTHORITY. A stepped velocity
     * command from standstill is the exact hazard the old bridge-side ramp
     * existed to avoid ("knocked the trot over"), so that protection is kept
     * here - but only on the SPEED channel. Yaw rate is nav's steering
     * output, recomputed fresh every tick from the actual heading error, not
     * a fixed step; letting it act at full strength from tick one is what
     * fixes the straight-line overshoot, and it is already measured safe at
     * far higher authority than this ever asks for (3.0 rad/s stationary
     * spin, roll < 1.5 deg, nothing falls - see the yaw envelope results).
     */
    /*
     * HOST-STALL: DETECT AND LOG ONLY. NO INTERVENTION.
     *
     * This block used to pause the mission, lie the dog down and stand it
     * back up. That was a mistake and it is removed. A single 4.8 ms tick -
     * ordinary scheduler jitter on a machine sitting at 24% CPU - tripped
     * it mid-dash, it zeroed a 3.00 m/s command in one tick, and the dog
     * flipped to roll=154. The "safety" response destroyed a run that was
     * otherwise perfect and, worse, destroyed the EVIDENCE: a mitigated run
     * tells you nothing about what the stall would actually have done.
     *
     * Per direct instruction: the dog can fall on its own. Record where and
     * when the stall landed so the data is analysable, and let the run play
     * out honestly. The detector in RobotRunner::run() prints the period
     * itself; this adds the mission context (waypoint, speed) that makes it
     * possible to line a stall up against an outcome afterwards.
     */
    if (hostStallActive()) {
      static bool noted = false;
      if (!noted) {
        noted = true;
        shmtrace::logf(elapsed(), "[nav] host stall seen at t=%.1fs (wp%d/%d, v=%.2f) - "
               "NOT intervening, run continues",
               elapsed(), nav.activeIndex(), nav.count(), nv);
      }
    }

    const float vscale = std::min(1.f, (elapsed() - restart_t) / std::max(0.1f, vx_ramp_s));
    bridge->driverCommand().leftStickAnalog[1]  = nv * vscale;
    bridge->driverCommand().rightStickAnalog[0] = yaw_sign * nw;

    static int navlog = 0;
    if ((++navlog % 50) == 0) {   // 1 Hz
      shmtrace::logf(elapsed(), "[nav] wp%d/%d N=%.2f E=%.2f hdg=%.0f d=%.2f v=%.2f w=%.2f t=%.1fs",
             nav.activeIndex(), nav.count(), N, E, bearing * 57.2958f,
             nav.lastDistance(), nv, nw, elapsed());
    }
  }
}

int main(int argc, char** argv) {
  // Line-buffer stdout. The sweep harness ends runs with SIGTERM (timeout, or
  // the fall detector), and a block-buffered stdout loses everything still in
  // the buffer when that lands - which reads as "the run produced no log".
  setvbuf(stdout, nullptr, _IOLBF, 0);

  g_peer                 = (argc > 1) ? argv[1] : "127.0.0.1";
  std::string robot_yaml = (argc > 2) ? argv[2] : "stm32mp1-defaults.yaml";
  std::string user_yaml  = (argc > 3) ? argv[3] : "mc-mit-ctrl-user-parameters.yaml";

  shmtrace::logf(0.0, "[mit-sim] Gazebo SITL | peer=%s robot=%s user=%s",
         g_peer.c_str(), robot_yaml.c_str(), user_yaml.c_str());

  MIT_Controller* ctrl = new MIT_Controller();
  Stm32mp1HardwareBridge bridge(ctrl, robot_yaml, user_yaml,
                                Stm32mp1HardwareBridge::Backend::GAZEBO);
  GazeboUdpConfig g;
  g.peer_addr   = g_peer.c_str();
  /*
   * PARALLEL INSTANCES. $SIM_INSTANCE shifts this dog's UDP ports so several
   * can share the Mac: instance 0 keeps 9100/9101, instance 1 gets 9110/9111,
   * and so on. Gazebo transport is isolated separately with $GZ_PARTITION -
   * ports alone are not enough, because two servers on the default partition
   * see each other's topics and the bridges cross-feed.
   */
  const int inst = getenv("SIM_INSTANCE") ? atoi(getenv("SIM_INSTANCE")) : 0;
  g.cmd_port    = 9100 + 10 * inst;
  g.sensor_port = 9101 + 10 * inst;
  bridge.setGazebo(g);

  std::thread(navThread, &bridge).detach();

  bridge.run();
  return 0;
}
